app/Controllers/Clientes.php

    public function index()
    {
        $cliente_model = new ClienteModel();

        $clientes = $cliente_model
                        ->findAll();
---
SELECT *
FROM `clientes`